# Q1. List any five functions of the pandas library with execution

`read_csv()`: This function is used to read data from a CSV file and create a DataFrame.

In [2]:
import pandas as pd
titanic = pd.read_csv('titanic.csv')

`head()`: It returns the first n rows of a DataFrame. By default, it returns the first five rows.

In [2]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

`describe()`: This function provides descriptive statistics of a DataFrame, including count, mean, standard deviation, minimum, quartiles, and maximum values.

In [3]:
titanic.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

`groupby()`: It is used to split a DataFrame into groups based on one or more columns. It allows performing operations on these groups separately.

In [12]:
age = titanic.groupby(['Age', 'Fare'])

`to_csv()`: This function is used to write a DataFrame to a CSV file.

In [15]:
age = pd.DataFrame(age)
age.to_csv('age.csv')

# Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row..

In [32]:
data = {'Name' : ['Darshan Baslani', 'Keval Thakar', 'Rushi Thesiya'],
       'Age': [18,18,19]}
df = pd.DataFrame(data, index=['A','B','C'])

In [34]:
df

              Name  Age
A  Darshan Baslani   18
B     Keval Thakar   18
C    Rushi Thesiya   19

In [38]:
def rename_cols(df):
    df = df.reset_index(drop=True)
    print(df)

In [40]:
rename_cols(df)

              Name  Age
0  Darshan Baslani   18
1     Keval Thakar   18
2    Rushi Thesiya   19

# Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console.
# For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should calculate and print the sum of the first three values, which is 60.s 60.

In [3]:
data = {'fruits': ['mango', 'banana', 'apple', 'kiwi', 'watermelon'],
        'quantity': [40, 30, 10, 20, 25]}
fruits = pd.DataFrame(data)

def calculate_sum(fruits):
    values = fruits['quantity']
    ans = sum(values[:3])
    print(ans)

calculate_sum(fruits)

80

# Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column..